<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"de2d543c69beb4025f93579d9ca97bfbc6eb75604820bf7fa69fc5310680deaa","plan_job_ref":"Job Plan Airflow DAGs #182 at https://github.com/cal-itp/data-infra/actions/runs/16135874512","plan_out_hash":"d3ea6c36994cee91f25a4d00f3981555ea4fb5f82fbc35667568ae3f4eb53cad","plan_hash":"4ad3ace4830865aa30a85278c45151717df8ea63c5520bacd456cdd1b1de3587","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __iac/cal-itp-data-infra/airflow/us__
<details>
<summary>Plan: 4 to add, 8 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!~  update in-place

Terraform will perform the following actions:

  # google_storage_bucket_object.calitp-composer["dags/sync_ntd_data_api/METADATA.yml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer" {
!~      crc32c              = "Lgf4nQ==" -> (known after apply)
!~      detect_md5hash      = "rCANrMhG1kIWCQ12PoEMWQ==" -> "different hash"
!~      generation          = 1751416671207872 -> (known after apply)
        id                  = "calitp-composer-dags/sync_ntd_data_api/METADATA.yml"
!~      md5hash             = "rCANrMhG1kIWCQ12PoEMWQ==" -> (known after apply)
        name                = "dags/sync_ntd_data_api/METADATA.yml"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer["dags/sync_ntd_data_api/safety_service_and_security_historical/monthly_modal_time_series_safety_and_service.yml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer" {
!~      crc32c              = "GEGU9Q==" -> (known after apply)
!~      detect_md5hash      = "+Ywj0izamcZu64c9iEguTQ==" -> "different hash"
!~      generation          = 1751416673602515 -> (known after apply)
        id                  = "calitp-composer-dags/sync_ntd_data_api/safety_service_and_security_historical/monthly_modal_time_series_safety_and_service.yml"
!~      md5hash             = "+Ywj0izamcZu64c9iEguTQ==" -> (known after apply)
        name                = "dags/sync_ntd_data_api/safety_service_and_security_historical/monthly_modal_time_series_safety_and_service.yml"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer["dags/sync_ntd_data_api/safety_service_and_security_historical/nonmajor_safety_and_security_events.yml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer" {
!~      crc32c              = "h/6yWw==" -> (known after apply)
!~      detect_md5hash      = "F168foRyrBDFOgtaFgbOdA==" -> "different hash"
!~      generation          = 1751416674952636 -> (known after apply)
        id                  = "calitp-composer-dags/sync_ntd_data_api/safety_service_and_security_historical/nonmajor_safety_and_security_events.yml"
!~      md5hash             = "F168foRyrBDFOgtaFgbOdA==" -> (known after apply)
        name                = "dags/sync_ntd_data_api/safety_service_and_security_historical/nonmajor_safety_and_security_events.yml"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer["dags/sync_ntd_data_xlsx/METADATA.yml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer" {
!~      crc32c              = "NMRUew==" -> (known after apply)
!~      detect_md5hash      = "rCtnD8qfIIeEfGb+EFLDeg==" -> "different hash"
!~      generation          = 1751416671368254 -> (known after apply)
        id                  = "calitp-composer-dags/sync_ntd_data_xlsx/METADATA.yml"
!~      md5hash             = "rCtnD8qfIIeEfGb+EFLDeg==" -> (known after apply)
        name                = "dags/sync_ntd_data_xlsx/METADATA.yml"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer["plugins/operators/__init__.py"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer" {
!~      crc32c              = "KNXkwQ==" -> (known after apply)
!~      detect_md5hash      = "T+Hf5rudNxVmZlWvKrPiQg==" -> "different hash"
!~      generation          = 1751416671440094 -> (known after apply)
        id                  = "calitp-composer-plugins/operators/__init__.py"
!~      md5hash             = "T+Hf5rudNxVmZlWvKrPiQg==" -> (known after apply)
        name                = "plugins/operators/__init__.py"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer["plugins/operators/airtable_to_gcs_operator.py"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer" {
!~      crc32c              = "FHYR7A==" -> (known after apply)
!~      detect_md5hash      = "AQq7qTt2LhXWHsTFgY6eTg==" -> "different hash"
!~      generation          = 1751416671549132 -> (known after apply)
        id                  = "calitp-composer-plugins/operators/airtable_to_gcs_operator.py"
!~      md5hash             = "AQq7qTt2LhXWHsTFgY6eTg==" -> (known after apply)
        name                = "plugins/operators/airtable_to_gcs_operator.py"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer["plugins/operators/ntd_to_gcs_operator.py"] will be created
+   resource "google_storage_bucket_object" "calitp-composer" {
+       bucket         = "calitp-composer"
+       content        = (sensitive value)
+       content_type   = (known after apply)
+       crc32c         = (known after apply)
+       detect_md5hash = "different hash"
+       generation     = (known after apply)
+       id             = (known after apply)
+       kms_key_name   = (known after apply)
+       md5hash        = (known after apply)
+       md5hexhash     = (known after apply)
+       media_link     = (known after apply)
+       name           = "plugins/operators/ntd_to_gcs_operator.py"
+       output_name    = (known after apply)
+       self_link      = (known after apply)
+       source         = "../../../../airflow/plugins/operators/ntd_to_gcs_operator.py"
+       storage_class  = (known after apply)
    }

  # google_storage_bucket_object.calitp-composer["plugins/src/__init__.py"] will be created
+   resource "google_storage_bucket_object" "calitp-composer" {
+       bucket         = "calitp-composer"
+       content        = (sensitive value)
+       content_type   = (known after apply)
+       crc32c         = (known after apply)
+       detect_md5hash = "different hash"
+       generation     = (known after apply)
+       id             = (known after apply)
+       kms_key_name   = (known after apply)
+       md5hash        = (known after apply)
+       md5hexhash     = (known after apply)
+       media_link     = (known after apply)
+       name           = "plugins/src/__init__.py"
+       output_name    = (known after apply)
+       self_link      = (known after apply)
+       source         = "../../../../airflow/plugins/src/__init__.py"
+       storage_class  = (known after apply)
    }

  # google_storage_bucket_object.calitp-composer["plugins/src/bigquery_cleaner.py"] will be created
+   resource "google_storage_bucket_object" "calitp-composer" {
+       bucket         = "calitp-composer"
+       content        = (sensitive value)
+       content_type   = (known after apply)
+       crc32c         = (known after apply)
+       detect_md5hash = "different hash"
+       generation     = (known after apply)
+       id             = (known after apply)
+       kms_key_name   = (known after apply)
+       md5hash        = (known after apply)
+       md5hexhash     = (known after apply)
+       media_link     = (known after apply)
+       name           = "plugins/src/bigquery_cleaner.py"
+       output_name    = (known after apply)
+       self_link      = (known after apply)
+       source         = "../../../../airflow/plugins/src/bigquery_cleaner.py"
+       storage_class  = (known after apply)
    }

  # google_storage_bucket_object.calitp-composer-catalog will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer-catalog" {
!~      content             = (sensitive value)
!~      crc32c              = "D2WApA==" -> (known after apply)
!~      detect_md5hash      = "DTC5RjjBIcRSrZ19TPW5hQ==" -> "different hash"
!~      generation          = 1751587160280686 -> (known after apply)
        id                  = "calitp-composer-data/warehouse/target/catalog.json"
!~      md5hash             = "DTC5RjjBIcRSrZ19TPW5hQ==" -> (known after apply)
        name                = "data/warehouse/target/catalog.json"
#        (16 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer-manifest will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer-manifest" {
!~      content             = (sensitive value)
!~      crc32c              = "px6fHQ==" -> (known after apply)
!~      detect_md5hash      = "QUvf2eg2ujxZPZ31D57Iwg==" -> "different hash"
!~      generation          = 1751587161564869 -> (known after apply)
        id                  = "calitp-composer-data/warehouse/target/manifest.json"
!~      md5hash             = "QUvf2eg2ujxZPZ31D57Iwg==" -> (known after apply)
        name                = "data/warehouse/target/manifest.json"
#        (16 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer-partial_parse will be created
+   resource "google_storage_bucket_object" "calitp-composer-partial_parse" {
+       bucket         = "calitp-composer"
+       content        = (sensitive value)
+       content_type   = "application/vnd.msgpack"
+       crc32c         = (known after apply)
+       detect_md5hash = "different hash"
+       generation     = (known after apply)
+       id             = (known after apply)
+       kms_key_name   = (known after apply)
+       md5hash        = (known after apply)
+       md5hexhash     = (known after apply)
+       media_link     = (known after apply)
+       name           = "data/warehouse/target/partial_parse.msgpack"
+       output_name    = (known after apply)
+       self_link      = (known after apply)
+       storage_class  = (known after apply)
    }

Plan: 4 to add, 8 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Plan Airflow DAGs #182](https://github.com/cal-itp/data-infra/actions/runs/16135874512)